/****************************************************************************
FileName    : kernel/drivers/video/fbdev/tcc-fb/vioc/vioc_bvo.c
Description : Sigma Design TV encoder driver

Copyright (C) 2018 Telechips Inc.

This program is free software; you can redistribute it and/or modify it under the terms
of the GNU General Public License as published by the Free Software Foundation;
either version 2 of the License, or (at your option) any later version.

This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with
this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
Suite 330, Boston, MA 02111-1307 USA
****************************************************************************/

/* README
 * ======
 * BVO Input format
 * - YUV (each component has 12 bits)
 * - data ordering is V-Y-U (SWAP 3'b100: B-R-G)
 * So,
 * - DISP.DCTRL.R2Y = 1 (if DISP_PATH data is RGB format)
 * - DISP.DCTRL.ADVI = 1 (interlaced output)
 * - DISP.DCTRL.PXDW = 12 (24bits RGB888 Format)
 * - DISP.DALIGN.ALIGN = 0 (do not convert 10-to-8 bits)
 * - DISP.DALIGN.SWAPBF = b100 (SWAPBF b100)
 */

#include <asm/io.h>
#ifndef CONFIG_ARM64
#include <asm/mach-types.h>
#endif
#include <linux/clk.h>
#include <linux/errno.h>
#include <linux/delay.h>
#include <linux/of_address.h>
#include <video/tcc/vioc_tve.h>
#include <video/tcc/vioc_ddicfg.h>

/* Debugging stuff */
static int debug = 0;
#define dprintk(msg...)	if (debug) { printk( "\e[33mvioc_bvo:\e[0m " msg); }

/*
 * Registers offset
 */
#define BVO_XOFF			(0x18)	// 3
#define BVO_YOFF			(0x1C)	// 4
#define BVO_conv0			(0x20)	// 12
#define BVO_conv1			(0x24)	// 13
#define BVO_conv2			(0x28)	// 14
#define BVO_conv3			(0x2C)	// 15
#define BVO_conv4			(0x30)	// 16
#define BVO_conv5			(0x34)	// 17
#define BVO_SCPHASE			(0x38)	// 18
#define BVO_nothing			(0x3C)	// N/A
#define BVO_CONFIG1			(0x40)	// 19
#define BVO_SIZE			(0x44)	// 5
#define BVO_HS				(0x48)	// 6
#define BVO_VSOL			(0x4C)	// 7
#define BVO_VSOH			(0x50)	// 8
#define BVO_SEL				(0x54)	// 9
#define BVO_SEH				(0x58)	// 10
#define BVO_HD_hsync		(0x5C)
#define BVO_HD_vsync		(0x60)
#define BVO_CGMS			(0x64)	// 20
#define BVO_CC_AGC			(0x68)	// 21
#define BVO_TCONFIG			(0x6C)
#define BVO_txt_cfg			(0x70)
#define BVO_CONFIG2			(0x74)	// 22
#define BVO_CHROMA			(0x78)
#define BVO_timing_sync		(0x7C)
#define BVO_N0_N22			(0x80)	// 23
#define BVO_N1_N2_N3_N4		(0x84)	// 24
#define BVO_N5_N6_N7_N8		(0x88)	// 25
#define BVO_N9_N10_N11		(0x8C)	// 26
#define BVO_N12_N13_N14		(0x90)	// 27
#define BVO_N15_N16_N17		(0x94)	// 28
#define BVO_N19_N20_N21		(0x98)	// 29
#define BVO_ROUNDSTEP		(0x9C)
#define BVO_ext_rst_dr0		(0xA0)
#define BVO_ext_rst_dr1		(0xA4)
#define BVO_ext_rst_dr2		(0xA8)
#define BVO_ext_rst_dr3		(0xAC)
#define BVO_STARV0			(0xB0)	// 30
#define BVO_STARV1			(0xB4)	// 11
#define BVO_STARV2			(0xB8)	// 1
#define BVO_STARV3			(0xBC)	// 2
#define BVO_VBICTRL			(0xC0)
#define BVO_VBIDATA0		(0xC4)
#define BVO_VBIDATA1		(0xC8)
#define BVO_VBIDATA2		(0xCC)
#define BVO_VBIDATA3		(0xD0)
#define BVO_SIGDATA			(0xD4)

#define BVO_CONFIG1_DAC_ENABLE_SHIFT	(31)
#define BVO_CONFIG1_DAC_ENABLE_MASK		(0x1 << BVO_CONFIG1_DAC_ENABLE_SHIFT)

#define BVO_CGMS_ODD_SHIFT		(23)
#define BVO_CGMS_EVEN_SHIFT		(22)
#define BVO_CGMS_CRC_SHIFT		(21)
#define BVO_CGMS_DATA_SHIFT		(0)

#define BVO_CGMS_ODD_MASK		(0x1 << BVO_CGMS_ODD_SHIFT)
#define BVO_CGMS_EVEN_MASK		(0x1 << BVO_CGMS_EVEN_SHIFT)
#define BVO_CGMS_CRC_MASK		(0x1 << BVO_CGMS_CRC_SHIFT)
#define BVO_CGMS_DATA_MASK		(0xfffff << BVO_CGMS_DATA_SHIFT)

/*
 * bvo supported formats
 */
enum bvo_format {
	BVO_FMT_NTSC_J,			// NTSC_J

	BVO_FMT_NTSC_M,			// NTSC_M
	BVO_FMT_NTSC_M_CGMSA,
	BVO_FMT_NTSC_M_MV,

	BVO_FMT_PAL_60,			// PAL_60
	BVO_FMT_PAL_60_MV,

	BVO_FMT_PAL_BG,			// PAL_BG
	BVO_FMT_PAL_BG_MV,
	BVO_FMT_PAL_BG_WSS,
	BVO_FMT_PAL_BG_WSS_MV,

	BVO_FMT_PAL_M,			// PAL_M
	BVO_FMT_PAL_M_MV,

	BVO_FMT_PAL_NC_WSS,		// PAL_Nc

	BVO_FMT_MAX,
};

enum bvo_spec_type {
	BVO_TIMING_NTSC,
	BVO_TIMING_PAL,
	BVO_TIMING_MAX,
};

/*
 * struct bvo timing spec
 */
struct bvo_spec {
	enum bvo_spec_type btype;
	uint32_t HSIZE;
	uint32_t VSIZE;
	uint32_t PXDW;
	uint32_t CLKDIV;
	uint32_t IV;
	uint32_t IH;
	uint32_t IP;
	uint32_t DP;
	uint32_t NI;
	uint32_t TV;
	uint32_t LPW;
	uint32_t LPC;
	uint32_t LSWC;
	uint32_t LEWC;
	uint32_t FPW;
	uint32_t FLC;
	uint32_t FSWC;
	uint32_t FEWC;
	uint32_t FPW2;
	uint32_t FLC2;
	uint32_t FSWC2;
	uint32_t FEWC2;
};

struct bvo_spec bvo_spec_val[BVO_TIMING_MAX] = {
    /*    bvo_timing, HSIZE, VSIZE, PXDW, CLKDIV, IV, IH, IP, DP, NI, TV, LPW, LPC, LSWC, LEWC, FPW, FLC, FSWC, FEWC, FPW2, FLC2, FSWC2, FEWC2*/
    {BVO_TIMING_NTSC,   720,   480,   12,      0,  1,  1,  0,  0,  0,  1, 247, 2879, 227,   75,   5, 479,   29,    8,    5,  479,    30,     7}, /* Datasheet */
	{BVO_TIMING_PAL ,   720,   576,   12,      0,  1,  1,  0,  0,  0,  1, 251, 2879, 275,   57,   0, 575,   42,    4,    0,  575,    43,     3}, /* Datasheet */
};


/*
 * struct bvo registers
 */
struct bvo_regs {
	enum bvo_format bfmt;	// enum bvo_foramt
	uint32_t XOFF;				// 1
	uint32_t YOFF;				// 2
	uint32_t conv0;				// 3
	uint32_t conv1;				// 4
	uint32_t conv2;				// 5
	uint32_t conv3;				// 6
	uint32_t conv4;				// 7
	uint32_t conv5;				// 8
	uint32_t SCPHASE;			// 9
	uint32_t nothing;			// 10
	uint32_t CONFIG1;			// 11
	uint32_t SIZE;				// 12
	uint32_t HS;				// 13
	uint32_t VSOL;				// 14
	uint32_t VSOH;				// 15
	uint32_t SEL;				// 16
	uint32_t SEH;				// 17
	uint32_t HD_hsync;			// 18
	uint32_t HD_vsync;			// 19
	uint32_t CGMS;				// 20
	uint32_t CC_AGC;			// 21
	uint32_t TCONFIG;			// 22
	uint32_t txt_cfg;			// 23
	uint32_t CONFIG2;			// 24
	uint32_t CHROMA;			// 25
	uint32_t timing_sync;		// 26
	uint32_t N0_N22;			// 27
	uint32_t N1_N2_N3_N4;		// 28
	uint32_t N5_N6_N7_N8;		// 29
	uint32_t N9_N10_N11;		// 30
	uint32_t N12_N13_N14;		// 31
	uint32_t N15_N16_N17;		// 32
	uint32_t N19_N20_N21;		// 33
	uint32_t ROUNDSTEP;			// 34
	uint32_t ext_rst_dr0;		// 35
	uint32_t ext_rst_dr1;		// 36
	uint32_t ext_rst_dr2;		// 37
	uint32_t ext_rst_dr3;		// 38
	uint32_t STARV0;			// 39
	uint32_t STARV1;			// 40
	uint32_t STARV2;			// 41
	uint32_t STARV3;			// 42
	uint32_t VBICTRL;			// 43
	uint32_t VBIDATA0;			// 44
	uint32_t VBIDATA1;			// 45
	uint32_t VBIDATA2;			// 46
	uint32_t VBIDATA3;			// 47
	uint32_t SIGDATA;			// 48
};

/*
 * Default registers values by Sigma Design Inc.
 */
#define REG_VAL_NA (0xffffffff)
struct bvo_regs bvo_regs_val[BVO_FMT_MAX] = {
  /*{           bvo_format,   BVO_XOFF,   BVO_YOFF,      conv0,      conv1,      conv2,      conv3,      conv4,      conv5,    SCPHASE,    nothing,    CONFIG1,       SIZE,         HS,       VSOL,       VSOH,        SEL,        SEH,   HD_hsync,   HD_vsync,       CGMS,     CC_AGC,    TCONFIG,    txt_cfg,    CONFIG2,     CHROMA,timing_sync,     N0_N22,N1_N2_N3_N4,N5_N6_N7_N8, N9_N10_N11,N12_N13_N14,N15_N16_N17,N19_N20_N21,  ROUNDSTEP,ext_rst_dr0,ext_rst_dr1,ext_rst_dr2,ext_rst_dr3,     STARV0,     STARV1,     STARV2,     STARV3,    VBICTRL,   VBIDATA0,   VBIDATA1,   VBIDATA2,   VBIDATA3,    SIGDATA}*/
